Repository: batonogov/pine
Catalog: Pine/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans

# agentActivity.attribution.sessionLinked
source: Session-linked
de: Mit Sitzung verknüpft
es: Vinculado a sesión
fr: Lié à une session
ja: セッション連携
ko: 세션 연결됨
pt_br: Vinculado à sessão
ru: Связано с сеансом
zh_hans: 已关联会话

# agentActivity.attribution.sessionLinkedHint
source: Linked to a session by legacy activity data; this is not a verified agent event
de: Durch ältere Aktivitätsdaten mit einer Sitzung verknüpft; dies ist kein verifiziertes Agentenereignis
es: Vinculado a una sesión por datos de actividad heredados; no es un evento de agente verificado
fr: Lié à une session par des données d’activité héritées ; il ne s’agit pas d’un événement d’agent vérifié
ja: 従来のアクティビティデータによりセッションへ関連付けられています。検証済みのエージェントイベントではありません
ko: 기존 활동 데이터로 세션에 연결되었으며 확인된 에이전트 이벤트가 아닙니다
pt_br: Vinculado a uma sessão por dados de atividade legados; não é um evento de agente verificado
ru: Связано с сеансом по устаревшим данным активности; это не подтверждённое событие агента
zh_hans: 通过旧版活动数据关联到会话；这不是已验证的智能体事件

# agentActivity.attribution.inferred
source: Inferred
de: Abgeleitet
es: Inferido
fr: Déduit
ja: 推定
ko: 추론됨
pt_br: Inferido
ru: Предположительно
zh_hans: 推断

# agentActivity.attribution.ambiguous
source: Ambiguous
de: Mehrdeutig
es: Ambiguo
fr: Ambigu
ja: 曖昧
ko: 모호함
pt_br: Ambíguo
ru: Неоднозначно
zh_hans: 不明确

# agentActivity.attribution.inferredHint
source: Inferred from file-system timing; no verified agent event is available
de: Aus dem Zeitpunkt der Dateisystemaktivität abgeleitet; kein verifiziertes Agentenereignis ist verfügbar
es: Inferido por el momento de la actividad del sistema de archivos; no hay ningún evento de agente verificado
fr: Déduit de la chronologie du système de fichiers ; aucun événement d’agent vérifié n’est disponible
ja: ファイルシステムのタイミングから推定されています。検証済みのエージェントイベントはありません
ko: 파일 시스템 타이밍에서 추론되었습니다. 확인된 에이전트 이벤트가 없습니다
pt_br: Inferido pelo momento da atividade do sistema de arquivos; nenhum evento de agente verificado está disponível
ru: Определено по времени активности файловой системы; подтверждённое событие агента отсутствует
zh_hans: 根据文件系统活动时间推断；没有可用的已验证智能体事件

# agentActivity.attribution.ambiguousHint
source: Multiple active sessions could match; no agent is identified as the owner
de: Mehrere aktive Sitzungen könnten übereinstimmen; kein Agent wird als Urheber angegeben
es: Varias sesiones activas podrían coincidir; no se identifica a ningún agente como autor
fr: Plusieurs sessions actives peuvent correspondre ; aucun agent n’est identifié comme auteur
ja: 複数のアクティブなセッションが該当する可能性があります。所有者として特定されたエージェントはいません
ko: 여러 활성 세션이 일치할 수 있습니다. 어떤 에이전트도 소유자로 식별되지 않습니다
pt_br: Várias sessões ativas podem corresponder; nenhum agente é identificado como autor
ru: Подходят несколько активных сеансов; ни один агент не указан как автор
zh_hans: 可能与多个活动会话匹配；未将任何智能体标识为操作方

# agentActivity.attribution.stale
source: Stale
de: Veraltet
es: Desactualizado
fr: Obsolète
ja: 古い情報
ko: 오래됨
pt_br: Desatualizado
ru: Устарело
zh_hans: 已过期

# agentActivity.attribution.staleHint
source: The associated process has not been observed successfully recently
de: Der zugehörige Prozess wurde kürzlich nicht erfolgreich beobachtet
es: El proceso asociado no se ha observado correctamente recientemente
fr: Le processus associé n’a pas été observé avec succès récemment
ja: 関連プロセスは最近正常に確認されていません
ko: 연결된 프로세스가 최근 성공적으로 관찰되지 않았습니다
pt_br: O processo associado não foi observado com sucesso recentemente
ru: Связанный процесс недавно не удалось подтвердить
zh_hans: 最近未能成功观察到关联进程

# agentActivity.attribution.terminated
source: Terminated
de: Beendet
es: Finalizado
fr: Terminé
ja: 終了済み
ko: 종료됨
pt_br: Encerrado
ru: Завершено
zh_hans: 已终止

# agentActivity.attribution.terminatedHint
source: The associated process is no longer running
de: Der zugehörige Prozess wird nicht mehr ausgeführt
es: El proceso asociado ya no se está ejecutando
fr: Le processus associé n’est plus en cours d’exécution
ja: 関連プロセスは実行されていません
ko: 연결된 프로세스가 더 이상 실행 중이 아닙니다
pt_br: O processo associado não está mais em execução
ru: Связанный процесс больше не выполняется
zh_hans: 关联进程已不再运行

# agentActivity.attribution.verified
source: Verified
de: Verifiziert
es: Verificado
fr: Vérifié
ja: 検証済み
ko: 검증됨
pt_br: Verificado
ru: Проверено
zh_hans: 已验证

# agentActivity.attribution.verifiedHint
source: Validated by Pine's trusted structured event pipeline
de: Durch Pines vertrauenswürdige strukturierte Ereignispipeline validiert
es: Validado por la canalización de eventos estructurados de confianza de Pine
fr: Validé par le pipeline d’événements structurés fiable de Pine
ja: Pine の信頼された構造化イベントパイプラインで検証済み
ko: Pine의 신뢰할 수 있는 구조화 이벤트 파이프라인에서 검증됨
pt_br: Validado pelo pipeline confiável de eventos estruturados do Pine
ru: Проверено доверенным конвейером структурированных событий Pine
zh_hans: 已由 Pine 的可信结构化事件管道验证

# agentActivity.possibleSessions %lld
source: %lld possible sessions
de: %lld mögliche Sitzungen
es: %lld sesiones posibles
fr: %lld sessions possibles
ja: 候補セッション%lld件
ko: 가능한 세션 %lld개
pt_br: %lld sessões possíveis
ru: Возможных сеансов: %lld
zh_hans: %lld 个可能的会话

# agentActivity.fileChanged %@
source: File changed: %@
de: Datei geändert: %@
es: Archivo modificado: %@
fr: Fichier modifié : %@
ja: ファイルが変更されました：%@
ko: 파일 변경됨: %@
pt_br: Arquivo alterado: %@
ru: Файл изменён: %@
zh_hans: 文件已更改：%@

# agentAttention.title
source: Attention
de: Aufmerksamkeit
es: Atención
ja: 注意
ko: 주의
pt_br: Atenção
ru: Внимание
zh_hans: 注意

# agentAttention.empty
source: No agents need attention.
de: Keine Agenten benötigen Aufmerksamkeit.
es: Ningún agente necesita atención.
fr: Aucun agent ne nécessite d’attention.
ja: 注意が必要なエージェントはありません。
ko: 주의가 필요한 에이전트가 없습니다.
pt_br: Nenhum agente precisa de atenção.
ru: Нет агентов, требующих внимания.
zh_hans: 没有需要注意的智能体。

# agentActivity.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭

source: Enter a line number from 1 to %lld
de: Gib eine Zeilennummer von 1 bis %lld ein
es: Introduce un número de línea del 1 al %lld
fr: Saisissez un numéro de ligne de 1 à %lld
ja: 1 から %lld までの行番号を入力してください
ko: 1부터 %lld까지의 줄 번호를 입력하세요
pt_br: Digite um número de linha de 1 a %lld
ru: Введите номер строки от 1 до %lld
zh_hans: 请输入 1 到 %lld 之间的行号

source: Enter a valid line number
de: Gib eine gültige Zeilennummer ein
es: Introduce un número de línea válido
fr: Saisissez un numéro de ligne valide
ja: 有効な行番号を入力してください
ko: 올바른 줄 번호를 입력하세요
pt_br: Digite um número de linha válido
ru: Введите корректный номер строки
zh_hans: 请输入有效的行号

source: Go to line
de: Gehe zu Zeile
es: Ir a la línea
fr: Aller à la ligne
ja: 行へ移動
ko: 줄로 이동
pt_br: Ir para a linha
ru: Перейти к строке
zh_hans: 跳转到行

# Line %lld is out of range (1–%lld)
source: Line %1$lld is out of range (1–%2$lld)
de: Zeile %1$lld ist außerhalb des Bereichs (1–%2$lld)
es: La línea %1$lld está fuera del rango (1–%2$lld)
fr: La ligne %1$lld est hors plage (1–%2$lld)
ja: 行 %1$lld は範囲外です (1–%2$lld)
ko: 줄 %1$lld은(는) 범위를 벗어났습니다 (1–%2$lld)
pt_br: A linha %1$lld está fora do intervalo (1–%2$lld)
ru: Строка %1$lld вне диапазона (1–%2$lld)
zh_hans: 第 %1$lld 行超出范围 (1–%2$lld)

# verifiedDiff.title
source: Prepared Undo Preview
de: Vorbereitete Rückgängig-Vorschau
es: Vista previa de deshacer preparada
fr: Aperçu de l’annulation préparée
ja: 準備済み取り消しプレビュー
ko: 준비된 실행 취소 미리보기
pt_br: Prévia de desfazer preparada
ru: Подготовленный просмотр отмены
zh_hans: 已准备的撤销预览

# verifiedDiff.stalenessNotice
source: Checked against one workspace snapshot. Pine must revalidate authority and current files immediately before applying.
de: Mit einem einzelnen Arbeitsbereich-Snapshot geprüft. Pine muss Autorität und aktuelle Dateien unmittelbar vor der Anwendung erneut prüfen.
es: Comprobado con una instantánea del espacio de trabajo. Pine debe volver a validar la autorización y los archivos actuales justo antes de aplicar.
fr: Vérifié sur un instantané de l’espace de travail. Pine doit revalider l’autorité et les fichiers actuels juste avant l’application.
ja: 1 つのワークスペーススナップショットに対して確認済みです。適用直前に Pine が権限と現在のファイルを再検証する必要があります。
ko: 하나의 작업 공간 스냅샷을 기준으로 확인되었습니다. 적용 직전에 Pine이 권한과 현재 파일을 다시 검증해야 합니다.
pt_br: Verificado em um snapshot do espaço de trabalho. O Pine deve revalidar a autoridade e os arquivos atuais imediatamente antes de aplicar.
ru: Проверено относительно одного снимка рабочей области. Непосредственно перед применением Pine должен заново проверить полномочия и текущие файлы.
zh_hans: 已根据一个工作区快照进行检查。应用前，Pine 必须立即重新验证权限和当前文件。

# verifiedDiff.operationCount %lld
source: %lld operations
de: %lld Vorgänge
es: %lld operaciones
fr: %lld opérations
ja: %lld 件の操作
ko: 작업 %lld개
pt_br: %lld operações
ru: %lld операции
zh_hans: %lld 个操作

# verifiedDiff.byteCount %lld
source: %lld bytes
de: %lld Byte
fr: %lld octets
ja: %lld バイト
ko: %lld바이트
ru: %lld байта
zh_hans: %lld 字节

# verifiedDiff.kind.applyTextHunks
source: Checked hunks
de: Geprüfte Hunks
es: Fragmentos comprobados
fr: Blocs vérifiés
ja: 確認済みハンク
ko: 확인된 헝크
pt_br: Trechos verificados
ru: Проверенные блоки
zh_hans: 已检查的区块

# verifiedDiff.kind.restoreExactFile
source: Exact restore
de: Exakte Wiederherstellung
es: Restauración exacta
fr: Restauration exacte
ja: 完全復元
ko: 정확한 복원
pt_br: Restauração exata
ru: Точное восстановление
zh_hans: 精确恢复

# verifiedDiff.kind.removeCreatedFile
source: Remove created file
de: Erstellte Datei entfernen
es: Eliminar archivo creado
fr: Supprimer le fichier créé
ja: 作成されたファイルを削除
ko: 생성된 파일 제거
pt_br: Remover arquivo criado
ru: Удалить созданный файл
zh_hans: 移除已创建的文件

# verifiedDiff.kind.restoreDeletedFile
source: Restore deleted file
de: Gelöschte Datei wiederherstellen
es: Restaurar archivo eliminado
fr: Restaurer le fichier supprimé
ja: 削除されたファイルを復元
ko: 삭제된 파일 복원
pt_br: Restaurar arquivo excluído
ru: Восстановить удалённый файл
zh_hans: 恢复已删除的文件

# verifiedDiff.kind.simulateRenamedFile
source: Rename simulation
de: Umbenennung simulieren
es: Simulación de cambio de nombre
fr: Simulation de renommage
ja: 名前変更のシミュレーション
ko: 이름 변경 시뮬레이션
pt_br: Simulação de renomeação
ru: Симуляция переименования
zh_hans: 重命名模拟

# verifiedDiff.detail.applyTextHunks
source: Applies only the resolved inverse hunks.
de: Wendet nur die aufgelösten inversen Hunks an.
es: Aplica solo los fragmentos inversos resueltos.
fr: Applique uniquement les blocs inverses résolus.
ja: 解決済みの逆ハンクのみを適用します。
ko: 해결된 역방향 헝크만 적용합니다.
pt_br: Aplica apenas os trechos inversos resolvidos.
ru: Применяет только разрешённые обратные блоки.
zh_hans: 仅应用已解析的反向区块。

# verifiedDiff.detail.restoreExactFile
source: Restores the complete captured file state.
de: Stellt den vollständig erfassten Dateizustand wieder her.
es: Restaura el estado completo capturado del archivo.
fr: Restaure l’état complet capturé du fichier.
ja: キャプチャされた完全なファイル状態を復元します。
ko: 캡처된 전체 파일 상태를 복원합니다.
pt_br: Restaura o estado completo capturado do arquivo.
ru: Восстанавливает полное зафиксированное состояние файла.
zh_hans: 恢复已捕获的完整文件状态。

# verifiedDiff.detail.removeCreatedFile
source: Deletes the file created by the prepared change.
de: Löscht die durch die vorbereitete Änderung erstellte Datei.
es: Elimina el archivo creado por el cambio preparado.
fr: Supprime le fichier créé par la modification préparée.
ja: 準備済みの変更によって作成されたファイルを削除します。
ko: 준비된 변경으로 생성된 파일을 삭제합니다.
pt_br: Exclui o arquivo criado pela alteração preparada.
ru: Удаляет файл, созданный подготовленным изменением.
zh_hans: 删除由已准备更改创建的文件。

# verifiedDiff.detail.restoreDeletedFile
source: Recreates the file with captured contents.
de: Erstellt die Datei mit dem erfassten Inhalt neu.
es: Vuelve a crear el archivo con el contenido capturado.
fr: Recrée le fichier avec le contenu capturé.
ja: キャプチャ済みの内容でファイルを再作成します。
ko: 캡처된 내용으로 파일을 다시 만듭니다.
pt_br: Recria o arquivo com o conteúdo capturado.
ru: Создаёт файл заново с сохранённым содержимым.
zh_hans: 使用捕获的内容重新创建文件。

# verifiedDiff.detail.simulateRenamedFile
source: Shows a rename simulation; applying rename is unsupported.
de: Zeigt eine Umbenennungssimulation; das Anwenden wird nicht unterstützt.
es: Muestra una simulación de cambio de nombre; no se admite aplicarla.
fr: Affiche une simulation de renommage ; son application n’est pas prise en charge.
ja: 名前変更のシミュレーションを表示します。名前変更の適用には対応していません。
ko: 이름 변경 시뮬레이션을 표시합니다. 이름 변경 적용은 지원되지 않습니다.
pt_br: Mostra uma simulação de renomeação; a aplicação não é compatível.
ru: Показывает симуляцию переименования; применение не поддерживается.
zh_hans: 显示重命名模拟；不支持应用重命名。

# verifiedDiff.expectedCurrent
source: Expected current
de: Erwarteter aktueller Stand
es: Estado actual esperado
fr: État actuel attendu
ja: 想定される現在の状態
ko: 예상 현재 상태
pt_br: Estado atual esperado
ru: Ожидаемое текущее состояние
zh_hans: 预期当前状态

# verifiedDiff.result
source: Result
de: Ergebnis
es: Resultado
fr: Résultat
ja: 結果
ko: 결과
pt_br: Resultado
ru: Результат
zh_hans: 结果

# verifiedDiff.metadataOnly
source: Metadata-only change
de: Nur Metadaten geändert
es: Cambio solo de metadatos
fr: Modification des métadonnées uniquement
ja: メタデータのみの変更
ko: 메타데이터만 변경
pt_br: Alteração apenas de metadados
ru: Изменение только метаданных
zh_hans: 仅元数据更改

# verifiedDiff.metadataAlsoChanges
source: File metadata also changes
de: Dateimetadaten werden ebenfalls geändert
es: Los metadatos del archivo también cambian
fr: Les métadonnées du fichier changent également
ja: ファイルのメタデータも変更されます
ko: 파일 메타데이터도 변경됩니다
pt_br: Os metadados do arquivo também são alterados
ru: Метаданные файла также изменяются
zh_hans: 文件元数据也会更改

# verifiedDiff.lineEnding.noFinalNewline
source: [No final newline]
de: [Kein abschließender Zeilenumbruch]
es: [Sin salto de línea final]
fr: [Aucun saut de ligne final]
ja: [末尾の改行なし]
ko: [마지막 줄 바꿈 없음]
pt_br: [Sem nova linha final]
ru: [Нет завершающего перевода строки]
zh_hans: [末尾无换行符]

# verifiedDiff.fileKind.regularFile
source: regular file
de: reguläre Datei
es: archivo normal
fr: fichier standard
ja: 通常ファイル
ko: 일반 파일
pt_br: arquivo comum
ru: обычный файл
zh_hans: 普通文件

# verifiedDiff.fileKind.symbolicLink
source: symbolic link
de: symbolischer Link
es: enlace simbólico
fr: lien symbolique
ja: シンボリックリンク
ko: 심볼릭 링크
pt_br: link simbólico
ru: символическая ссылка
zh_hans: 符号链接

# verifiedDiff.identity.absent %@ %@
source: %1$@ · %2$@ · absent
de: %1$@ · %2$@ · nicht vorhanden
es: %1$@ · %2$@ · ausente
ja: %1$@ · %2$@ · 存在しない
ko: %1$@ · %2$@ · 없음
pt_br: %1$@ · %2$@ · ausente
ru: %1$@ · %2$@ · отсутствует
zh_hans: %1$@ · %2$@ · 不存在

# verifiedDiff.identity %@ %@ %@ %@ %@ %@
source: %1$@ · %2$@ · %3$@ · mode %4$@ · %5$@ · SHA-256 %6$@
de: %1$@ · %2$@ · %3$@ · Modus %4$@ · %5$@ · SHA-256 %6$@
es: %1$@ · %2$@ · %3$@ · modo %4$@ · %5$@ · SHA-256 %6$@
ja: %1$@ · %2$@ · %3$@ · モード %4$@ · %5$@ · SHA-256 %6$@
ko: %1$@ · %2$@ · %3$@ · 모드 %4$@ · %5$@ · SHA-256 %6$@
pt_br: %1$@ · %2$@ · %3$@ · modo %4$@ · %5$@ · SHA-256 %6$@
ru: %1$@ · %2$@ · %3$@ · режим %4$@ · %5$@ · SHA-256 %6$@
zh_hans: %1$@ · %2$@ · %3$@ · 模式 %4$@ · %5$@ · SHA-256 %6$@

# dialog.close
source: Close
de: Schließen
es: Cerrar
fr: Fermer
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
zh_hans: 关闭

# settings.general.autoSave
source: Auto Save
de: Automatisch speichern
es: Guardar automáticamente
fr: Enregistrement automatique
ja: 自動保存
ko: 자동 저장
pt_br: Salvar automaticamente
ru: Автосохранение
zh_hans: 自动保存

# settings.general.display
source: Display
de: Darstellung
es: Visualización
fr: Affichage
ja: 表示
ko: 표시
pt_br: Exibição
ru: Отображение
zh_hans: 显示

# settings.general.fontSize
source: Font Size
de: Schriftgröße
es: Tamaño de fuente
fr: Taille de police
ja: フォントサイズ
ko: 글꼴 크기
pt_br: Tamanho da fonte
ru: Размер шрифта
zh_hans: 字体大小

# settings.general.formatOnSave
source: Format on Save
de: Beim Sichern formatieren
es: Formatear al guardar
fr: Formater à l’enregistrement
ja: 保存時にフォーマット
ko: 저장 시 포맷
pt_br: Formatar ao salvar
ru: Форматировать при сохранении
zh_hans: 保存时格式化

# settings.general.formatting
source: Formatting
de: Formatierung
es: Formato
fr: Mise en forme
ja: 書式設定
ko: 서식
pt_br: Formatação
ru: Форматирование
zh_hans: 格式化

# settings.general.insertFinalNewline
source: Insert Final Newline
de: Abschließenden Zeilenumbruch einfügen
es: Insertar salto de línea final
fr: Insérer un saut de ligne final
ja: 末尾に改行を挿入
ko: 마지막 줄 바꿈 삽입
pt_br: Inserir quebra de linha final
ru: Добавлять перевод строки в конце
zh_hans: 在文件末尾插入换行符

# settings.general.minimap
source: Minimap
de: Minikarte
es: Minimapa
fr: Minicarte
ja: ミニマップ
ko: 미니맵
pt_br: Minimapa
ru: Мини-карта
zh_hans: 小地图

# settings.general.smartListContinuation
source: Smart List Continuation
de: Intelligente Listenfortsetzung
es: Continuación inteligente de listas
fr: Continuation intelligente des listes
ja: リストを自動継続
ko: 스마트 목록 이어쓰기
pt_br: Continuação inteligente de listas
ru: Продолжать списки автоматически
zh_hans: 智能延续列表

# settings.general.stripTrailingWhitespace
source: Strip Trailing Whitespace
de: Nachgestellte Leerzeichen entfernen
es: Eliminar espacios finales
fr: Supprimer les espaces de fin
ja: 行末の空白を削除
ko: 후행 공백 제거
pt_br: Remover espaços em branco à direita
ru: Удалять пробелы в конце строк
zh_hans: 删除行尾空格

# settings.general.title
source: General
de: Allgemein
fr: Général
ja: 一般
ko: 일반
pt_br: Geral
ru: Основные
zh_hans: 通用

# settings.general.wordWrap
source: Word Wrap
de: Zeilenumbruch
es: Ajuste de línea
fr: Retour à la ligne
ja: 行の折り返し
ko: 자동 줄 바꿈
pt_br: Quebra automática de linha
ru: Переносить строки
zh_hans: 自动换行

# settings.keyBindings.activeCount %lld
source: %lld active entries
de: %lld aktive Einträge
es: %lld entradas activas
fr: %lld entrées actives
ja: %lld 件の有効なエントリ
ko: 활성 항목 %lld개
pt_br: %lld entradas ativas
ru: %lld активной записи
zh_hans: %lld 个有效条目

# settings.keyBindings.effective
source: Effective Key Bindings
de: Aktive Tastenkürzel
es: Atajos efectivos
fr: Raccourcis actifs
ja: 有効なキーバインド
ko: 적용된 키 바인딩
pt_br: Atalhos efetivos
ru: Действующие сочетания клавиш
zh_hans: 生效的按键绑定

# settings.keyBindings.keybindings
source: Key Bindings
de: Tastenkürzel
es: Atajos de teclado
fr: Raccourcis clavier
ja: キーバインド
ko: 키 바인딩
pt_br: Atalhos de teclado
ru: Сочетания клавиш
zh_hans: 按键绑定

# settings.keyBindings.noOverrides
source: No custom key bindings.
de: Keine benutzerdefinierten Tastenkürzel.
es: No hay atajos personalizados.
fr: Aucun raccourci personnalisé.
ja: カスタムキーバインドはありません。
ko: 사용자 지정 키 바인딩이 없습니다.
pt_br: Nenhum atalho personalizado.
ru: Пользовательские сочетания клавиш не заданы.
zh_hans: 没有自定义按键绑定。

# settings.keyBindings.openFile
source: Open File
de: Datei öffnen
es: Abrir archivo
fr: Ouvrir le fichier
ja: ファイルを開く
ko: 파일 열기
pt_br: Abrir arquivo
ru: Открыть файл
zh_hans: 打开文件

# settings.keyBindings.reload
source: Reload
de: Neu laden
es: Recargar
fr: Recharger
ja: 再読み込み
ko: 다시 불러오기
pt_br: Recarregar
ru: Перезагрузить
zh_hans: 重新加载

# settings.keyBindings.reload.keybindingCount %lld
source: %lld key bindings
de: %lld Tastenkürzel
es: %lld atajos de teclado
fr: %lld raccourcis clavier
ja: %lld 件のキーバインド
ko: 키 바인딩 %lld개
pt_br: %lld atalhos de teclado
ru: %lld сочетания клавиш
zh_hans: %lld 个按键绑定

# settings.keyBindings.reload.problemCount %lld
source: Reloaded with %lld problems.
de: Mit %lld Problemen neu geladen.
es: Se recargó con %lld problemas.
fr: Rechargé avec %lld problèmes.
ja: %lld 件の問題がある状態で再読み込みしました。
ko: 문제 %lld개와 함께 다시 불러왔습니다.
pt_br: Recarregado com %lld problemas.
ru: Перезагружено с %lld проблемы.
zh_hans: 重新加载时发现 %lld 个问题。

# settings.keyBindings.reload.success %@ %@
source: Reloaded: %1$@, %2$@.
de: Neu geladen: %1$@, %2$@.
es: Se recargaron: %1$@, %2$@.
fr: Rechargé : %1$@, %2$@.
ja: %1$@、%2$@を再読み込みしました。
ko: %1$@와 %2$@을 다시 불러왔습니다.
pt_br: Recarregados: %1$@, %2$@.
ru: Перезагружено: %1$@, %2$@.
zh_hans: 已重新加载：%1$@，%2$@。

# settings.keyBindings.reload.taskCount %lld
source: %lld tasks
de: %lld Aufgaben
es: %lld tareas
fr: %lld tâches
ja: %lld 件のタスク
ko: 작업 %lld개
pt_br: %lld tarefas
ru: %lld задачи
zh_hans: %lld 个任务

# settings.keyBindings.tasks
source: Tasks
de: Aufgaben
es: Tareas
fr: Tâches
ja: タスク
ko: 작업
pt_br: Tarefas
ru: Задачи
zh_hans: 任务

# settings.keyBindings.title
source: Key Bindings & Tasks
de: Tastenkürzel & Aufgaben
es: Atajos de teclado y tareas
fr: Raccourcis clavier et tâches
ja: キーバインドとタスク
ko: 키 바인딩 및 작업
pt_br: Atalhos de teclado e tarefas
ru: Сочетания клавиш и задачи
zh_hans: 按键绑定与任务

# settings.lsp.executable.prompt
source: Choose
de: Auswählen
es: Seleccionar
fr: Choisir
ja: 選択
ko: 선택
pt_br: Escolher
ru: Выбрать
zh_hans: 选择

# settings.tab.general
source: General
de: Allgemein
fr: Général
ja: 一般
ko: 일반
pt_br: Geral
ru: Основные
zh_hans: 通用

# settings.tab.keyBindings
source: Key Bindings & Tasks
de: Tastenkürzel & Aufgaben
es: Atajos de teclado y tareas
fr: Raccourcis clavier et tâches
ja: キーバインドとタスク
ko: 키 바인딩 및 작업
pt_br: Atalhos de teclado e tarefas
ru: Сочетания клавиш и задачи
zh_hans: 按键绑定与任务

# settings.quickTerminal.hotkey.modifierRequired
source: Include at least one of ⌘, ⌃, or ⌥.
de: Verwende mindestens eine der Tasten ⌘, ⌃ oder ⌥.
es: Incluye al menos una de las teclas ⌘, ⌃ o ⌥.
fr: Ajoutez au moins l’une des touches ⌘, ⌃ ou ⌥.
ja: ⌘、⌃、⌥ のいずれかを1つ以上含めてください。
ko: ⌘, ⌃, ⌥ 중 하나 이상을 포함하세요.
pt_br: Inclua pelo menos uma das teclas ⌘, ⌃ ou ⌥.
ru: Добавьте хотя бы одну из клавиш ⌘, ⌃ или ⌥.
zh_hans: 请至少包含 ⌘、⌃ 或 ⌥ 中的一个。

# settings.quickTerminal.reset
source: Reset Quick Terminal Settings
de: Schnellterminal zurücksetzen
es: Restablecer ajustes del terminal rápido
fr: Réinitialiser le terminal rapide
ja: クイックターミナル設定をリセット
ko: 빠른 터미널 설정 재설정
pt_br: Redefinir ajustes do Terminal rápido
ru: Сбросить настройки быстрого терминала
zh_hans: 还原快速终端设置

# settings.terminal.appearance.help
source: Choose whether the terminal follows the system appearance or always uses the light or dark variant.
de: Legt fest, ob das Terminal der Systemdarstellung folgt oder immer die helle bzw. dunkle Variante verwendet.
es: Elige si el terminal sigue la apariencia del sistema o usa siempre la variante clara u oscura.
fr: Choisissez si le terminal suit l’apparence du système ou utilise toujours la variante claire ou sombre.
ja: ターミナルがシステムの外観に従うか、常にライトまたはダークを使うかを選びます。
ko: 터미널이 시스템 화면 모드를 따를지, 항상 라이트 또는 다크 변형을 사용할지 선택합니다.
pt_br: Escolha se o terminal segue a aparência do sistema ou sempre usa a variante clara ou escura.
ru: Выберите, следует ли терминал системному оформлению или всегда использует светлый либо тёмный вариант.
zh_hans: 选择终端是跟随系统外观，还是始终使用浅色或深色版本。

# settings.terminal.appearance.label
source: Appearance
de: Darstellung
es: Apariencia
fr: Apparence
ja: 外観
ko: 화면 모드
pt_br: Aparência
ru: Оформление
zh_hans: 外观

# settings.terminal.arguments
source: Arguments
de: Argumente
es: Argumentos
ja: 引数
ko: 인수
pt_br: Argumentos
ru: Аргументы
zh_hans: 参数

# settings.terminal.argumentsHelp
source: Enter one literal argument per line.
de: Ein wörtliches Argument pro Zeile.
es: Introduce un argumento literal por línea.
fr: Saisissez un argument littéral par ligne.
ja: 1行に1つの引数をそのまま入力します。
ko: 한 줄에 하나의 리터럴 인수를 입력합니다.
pt_br: Insira um argumento literal por linha.
ru: Введите по одному аргументу без обработки на строку.
zh_hans: 每行输入一个原样参数。

# settings.terminal.quickTerminal
source: Quick Terminal
de: Schnellterminal
es: Terminal rápido
fr: Terminal rapide
ja: クイックターミナル
ko: 빠른 터미널
pt_br: Terminal rápido
ru: Быстрый терминал
zh_hans: 快速终端

# settings.terminal.resetArgs
source: Reset Shell Settings
de: Shell-Einstellungen zurücksetzen
es: Restablecer ajustes del intérprete
fr: Réinitialiser les réglages du shell
ja: シェル設定をリセット
ko: 셸 설정 재설정
pt_br: Redefinir ajustes do shell
ru: Сбросить настройки оболочки
zh_hans: 还原 Shell 设置

# settings.terminal.resolvedPrefix
source: Resolved:
de: Aufgelöst:
es: Ruta efectiva:
fr: Chemin résolu :
ja: 解決されたパス:
ko: 확인된 경로:
pt_br: Caminho resolvido:
ru: Итоговый путь:
zh_hans: 解析路径：

# settings.terminal.shellOther
source: Other…
de: Andere…
es: Otro…
fr: Autre…
ja: その他…
ko: 기타…
pt_br: Outro…
ru: Другая…
zh_hans: 其他…
